espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG23/Include/efm32pg23_prs_signals.h
/**
 * Asynchronous signals and sources combined and aligned with register bit fields
 * without the '_ASYNCH_' infix in order for backward compatibility:
 */
#define PRS_USART0_CS                                      (PRS_ASYNC_USART0_CS)
#define PRS_USART0_IRTX                                    (PRS_ASYNC_USART0_IRTX)
#define PRS_USART0_RTS                                     (PRS_ASYNC_USART0_RTS)
#define PRS_USART0_RXDATA                                  (PRS_ASYNC_USART0_RXDATA)
#define PRS_USART0_TX                                      (PRS_ASYNC_USART0_TX)
#define PRS_USART0_TXC                                     (PRS_ASYNC_USART0_TXC)
#define PRS_TIMER0_UF                                      (PRS_ASYNC_TIMER0_UF)
#define PRS_TIMER0_OF                                      (PRS_ASYNC_TIMER0_OF)
#define PRS_TIMER0_CC0                                     (PRS_ASYNC_TIMER0_CC0)
#define PRS_TIMER0_CC1                                     (PRS_ASYNC_TIMER0_CC1)
#define PRS_TIMER0_CC2                                     (PRS_ASYNC_TIMER0_CC2)
#define PRS_TIMER1_UF                                      (PRS_ASYNC_TIMER1_UF)
#define PRS_TIMER1_OF                                      (PRS_ASYNC_TIMER1_OF)
#define PRS_TIMER1_CC0                                     (PRS_ASYNC_TIMER1_CC0)
#define PRS_TIMER1_CC1                                     (PRS_ASYNC_TIMER1_CC1)
#define PRS_TIMER1_CC2                                     (PRS_ASYNC_TIMER1_CC2)
#define PRS_IADC0_SCANENTRYDONE                            (PRS_ASYNC_IADC0_SCANENTRYDONE)
#define PRS_IADC0_SCANTABLEDONE                            (PRS_ASYNC_IADC0_SCANTABLEDONE)
#define PRS_IADC0_SINGLEDONE                               (PRS_ASYNC_IADC0_SINGLEDONE)
#define PRS_LETIMER0_CH0                                   (PRS_ASYNC_LETIMER0_CH0)
#define PRS_LETIMER0_CH1                                   (PRS_ASYNC_LETIMER0_CH1)
#define PRS_BURTC_COMP                                     (PRS_ASYNC_BURTC_COMP)
#define PRS_BURTC_OVERFLOW                                 (PRS_ASYNC_BURTC_OVERFLOW)
#define PRS_GPIO_PIN0                                      (PRS_ASYNC_GPIO_PIN0)
#define PRS_GPIO_PIN1                                      (PRS_ASYNC_GPIO_PIN1)
#define PRS_GPIO_PIN2                                      (PRS_ASYNC_GPIO_PIN2)
#define PRS_GPIO_PIN3                                      (PRS_ASYNC_GPIO_PIN3)
#define PRS_GPIO_PIN4                                      (PRS_ASYNC_GPIO_PIN4)
#define PRS_GPIO_PIN5                                      (PRS_ASYNC_GPIO_PIN5)
#define PRS_GPIO_PIN6                                      (PRS_ASYNC_GPIO_PIN6)
#define PRS_GPIO_PIN7                                      (PRS_ASYNC_GPIO_PIN7)
#define PRS_TIMER2_UF                                      (PRS_ASYNC_TIMER2_UF)
#define PRS_TIMER2_OF                                      (PRS_ASYNC_TIMER2_OF)
#define PRS_TIMER2_CC0                                     (PRS_ASYNC_TIMER2_CC0)
#define PRS_TIMER2_CC1                                     (PRS_ASYNC_TIMER2_CC1)
#define PRS_TIMER2_CC2                                     (PRS_ASYNC_TIMER2_CC2)
#define PRS_TIMER3_UF                                      (PRS_ASYNC_TIMER3_UF)
#define PRS_TIMER3_OF                                      (PRS_ASYNC_TIMER3_OF)
#define PRS_TIMER3_CC0                                     (PRS_ASYNC_TIMER3_CC0)
#define PRS_TIMER3_CC1                                     (PRS_ASYNC_TIMER3_CC1)
#define PRS_TIMER3_CC2                                     (PRS_ASYNC_TIMER3_CC2)
#define PRS_CORE_CTIOUT0                                   (PRS_ASYNC_CORE_CTIOUT0)
#define PRS_CORE_CTIOUT1                                   (PRS_ASYNC_CORE_CTIOUT1)
#define PRS_CORE_CTIOUT2                                   (PRS_ASYNC_CORE_CTIOUT2)
#define PRS_CORE_CTIOUT3                                   (PRS_ASYNC_CORE_CTIOUT3)
#define PRS_CMUL_CLKOUT0                                   (PRS_ASYNC_CMUL_CLKOUT0)
#define PRS_CMUL_CLKOUT1                                   (PRS_ASYNC_CMUL_CLKOUT1)
#define PRS_CMUL_CLKOUT2                                   (PRS_ASYNC_CMUL_CLKOUT2)
#define PRS_PRSL_ASYNCH0                                   (PRS_ASYNC_PRSL_ASYNCH0)
#define PRS_PRSL_ASYNCH1                                   (PRS_ASYNC_PRSL_ASYNCH1)
#define PRS_PRSL_ASYNCH2                                   (PRS_ASYNC_PRSL_ASYNCH2)
#define PRS_PRSL_ASYNCH3                                   (PRS_ASYNC_PRSL_ASYNCH3)
#define PRS_PRSL_ASYNCH4                                   (PRS_ASYNC_PRSL_ASYNCH4)
#define PRS_PRSL_ASYNCH5                                   (PRS_ASYNC_PRSL_ASYNCH5)
#define PRS_PRSL_ASYNCH6                                   (PRS_ASYNC_PRSL_ASYNCH6)
#define PRS_PRSL_ASYNCH7                                   (PRS_ASYNC_PRSL_ASYNCH7)
#define PRS_PRS_ASYNCH8                                    (PRS_ASYNC_PRS_ASYNCH8)
#define PRS_PRS_ASYNCH9                                    (PRS_ASYNC_PRS_ASYNCH9)
#define PRS_PRS_ASYNCH10                                   (PRS_ASYNC_PRS_ASYNCH10)
#define PRS_PRS_ASYNCH11                                   (PRS_ASYNC_PRS_ASYNCH11)
#define PRS_TIMER4_UF                                      (PRS_ASYNC_TIMER4_UF)
#define PRS_TIMER4_OF                                      (PRS_ASYNC_TIMER4_OF)
#define PRS_TIMER4_CC0                                     (PRS_ASYNC_TIMER4_CC0)
#define PRS_TIMER4_CC1                                     (PRS_ASYNC_TIMER4_CC1)
#define PRS_TIMER4_CC2                                     (PRS_ASYNC_TIMER4_CC2)
#define PRS_ACMP0_OUT                                      (PRS_ASYNC_ACMP0_OUT)
#define PRS_ACMP1_OUT                                      (PRS_ASYNC_ACMP1_OUT)
#define PRS_VDAC0L_CH0WARM                                 (PRS_ASYNC_VDAC0L_CH0WARM)
#define PRS_VDAC0L_CH1WARM                                 (PRS_ASYNC_VDAC0L_CH1WARM)
#define PRS_VDAC0L_CH0DONEASYNC                            (PRS_ASYNC_VDAC0L_CH0DONEASYNC)
#define PRS_VDAC0L_CH1DONEASYNC                            (PRS_ASYNC_VDAC0L_CH1DONEASYNC)
#define PRS_VDAC0L_INTERNALTIMEROF                         (PRS_ASYNC_VDAC0L_INTERNALTIMEROF)
#define PRS_VDAC0L_REFRESHTIMEROF                          (PRS_ASYNC_VDAC0L_REFRESHTIMEROF)
#define PRS_PCNT0_DIR                                      (PRS_ASYNC_PCNT0_DIR)
#define PRS_PCNT0_UFOF                                     (PRS_ASYNC_PCNT0_UFOF)
#define PRS_SYSRTC0_GRP0OUT0                               (PRS_ASYNC_SYSRTC0_GRP0OUT0)
#define PRS_SYSRTC0_GRP0OUT1                               (PRS_ASYNC_SYSRTC0_GRP0OUT1)
#define PRS_SYSRTC0_GRP1OUT0                               (PRS_ASYNC_SYSRTC0_GRP1OUT0)
#define PRS_SYSRTC0_GRP1OUT1                               (PRS_ASYNC_SYSRTC0_GRP1OUT1)
#define PRS_LESENSE_DECOUT0                                (PRS_ASYNC_LESENSE_DECOUT0)
#define PRS_LESENSE_DECOUT1                                (PRS_ASYNC_LESENSE_DECOUT1)
#define PRS_LESENSE_DECOUT2                                (PRS_ASYNC_LESENSE_DECOUT2)
#define PRS_LESENSE_DECCMP                                 (PRS_ASYNC_LESENSE_DECCMP)
#define PRS_HFXO0L_STATUS                                  (PRS_ASYNC_HFXO0L_STATUS)
#define PRS_HFXO0L_STATUS1                                 (PRS_ASYNC_HFXO0L_STATUS1)
#define PRS_EUSART0L_CS                                    (PRS_ASYNC_EUSART0L_CS)
#define PRS_EUSART0L_IRDATX                                (PRS_ASYNC_EUSART0L_IRDATX)
#define PRS_EUSART0L_RTS                                   (PRS_ASYNC_EUSART0L_RTS)
#define PRS_EUSART0L_RXDATAV                               (PRS_ASYNC_EUSART0L_RXDATAV)
#define PRS_EUSART0L_TX                                    (PRS_ASYNC_EUSART0L_TX)
#define PRS_EUSART0L_TXC                                   (PRS_ASYNC_EUSART0L_TXC)
#define PRS_EUSART0L_RXFL                                  (PRS_ASYNC_EUSART0L_RXFL)
#define PRS_EUSART0L_TXFL                                  (PRS_ASYNC_EUSART0L_TXFL)
#define PRS_EUSART1L_CS                                    (PRS_ASYNC_EUSART1L_CS)
#define PRS_EUSART1L_IRDATX                                (PRS_ASYNC_EUSART1L_IRDATX)
#define PRS_EUSART1L_RTS                                   (PRS_ASYNC_EUSART1L_RTS)
#define PRS_EUSART1L_RXDATAV                               (PRS_ASYNC_EUSART1L_RXDATAV)
#define PRS_EUSART1L_TX                                    (PRS_ASYNC_EUSART1L_TX)
#define PRS_EUSART1L_TXC                                   (PRS_ASYNC_EUSART1L_TXC)
#define PRS_EUSART1L_RXFL                                  (PRS_ASYNC_EUSART1L_RXFL)
#define PRS_EUSART1L_TXFL                                  (PRS_ASYNC_EUSART1L_TXFL)
#define PRS_EUSART2L_CS                                    (PRS_ASYNC_EUSART2L_CS)
#define PRS_EUSART2L_IRDATX                                (PRS_ASYNC_EUSART2L_IRDATX)
#define PRS_EUSART2L_RTS                                   (PRS_ASYNC_EUSART2L_RTS)
#define PRS_EUSART2L_RXDATAV                               (PRS_ASYNC_EUSART2L_RXDATAV)
#define PRS_EUSART2L_TX                                    (PRS_ASYNC_EUSART2L_TX)
#define PRS_EUSART2L_TXC                                   (PRS_ASYNC_EUSART2L_TXC)
#define PRS_EUSART2L_RXFL                                  (PRS_ASYNC_EUSART2L_RXFL)
#define PRS_EUSART2L_TXFL                                  (PRS_ASYNC_EUSART2L_TXFL)

#endif /* EFM32PG23_PRS_SIGNALS_H */
